In [1]:
import pandas as pd
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [68]:

import pandas as pd
df=pd.read_csv('hiring.csv')
values={'five':5, 'two':2, 'seven':7, 'three':3 , 'ten':10, 'eleven':11}
df=df.replace({"experience":values})
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    NaN                           7      72000
7        11.0                    7.0                           8      80000

In [69]:
df.experience.mean()

6.333333333333333

In [72]:
df.experience=df.experience.fillna(df.experience.mean())
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0    6.333333                    8.0                           9      50000
1    6.333333                    8.0                           6      45000
2    5.000000                    6.0                           7      60000
3    2.000000                   10.0                          10      65000
4    7.000000                    9.0                           6      70000
5    3.000000                    7.0                          10      62000
6   10.000000                    NaN                           7      72000
7   11.000000                    7.0                           8      80000

In [73]:
df['experience']=df['experience'].astype(int)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           6                    8.0                           9      50000
1           6                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [101]:
new_df=df.rename(columns={'test_score(out of 10)':'test_score','salary($)':'salary'})
new_df

   experience  test_score  interview_score(out of 10)  salary
0           6         8.0                           9   50000
1           6         8.0                           6   45000
2           5         6.0                           7   60000
3           2        10.0                          10   65000
4           7         9.0                           6   70000
5           3         7.0                          10   62000
6          10         NaN                           7   72000
7          11         7.0                           8   80000

In [87]:
new_df.test_score.mean()

7.857142857142857

In [107]:
new_df.test_score=new_df.test_score.fillna(new_df.test_score.mean())
new_df

   experience  test_score  interview_score(out of 10)  salary
0           6    8.000000                           9   50000
1           6    8.000000                           6   45000
2           5    6.000000                           7   60000
3           2   10.000000                          10   65000
4           7    9.000000                           6   70000
5           3    7.000000                          10   62000
6          10    7.857143                           7   72000
7          11    7.000000                           8   80000

In [106]:
df2=new_df.round({"test_score":0})
df2

   experience  test_score  interview_score(out of 10)  salary
0           6         8.0                           9   50000
1           6         8.0                           6   45000
2           5         6.0                           7   60000
3           2        10.0                          10   65000
4           7         9.0                           6   70000
5           3         7.0                          10   62000
6          10         8.0                           7   72000
7          11         7.0                           8   80000

In [108]:
from sklearn import linear_model
reg=linear_model.LinearRegression()
reg.fit(df2.drop('salary',axis='columns'),df2.salary)

LinearRegression()

In [110]:
reg.predict([[6,8,9]])

array([65756.09756098])

In [111]:
reg.coef_

array([2813.00813008, 1333.33333333, 2926.82926829])

In [113]:
reg.intercept_

11869.91869918695

In [114]:
2813.00813008*6+1333.33333333*8+2926.82926829*9+11869.91869918695

65756.09756091694

In [115]:
reg.predict([[60,8,9]])

array([217658.53658537])